app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" = ?  [["owner_id", 1]]
SELECT "races".* FROM "races" WHERE "races"."id" IN (1)
---
    def index
        user_id = params[:user_id] || @current_user.id
        @pets = Pet.includes(:race).where(owner_id: user_id)

INSERT INTO "pets" ("name", "race_id", "color", "about", "is_trained", "image", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        p = pet_params
        p[:owner_id] = @current_user.id
        render_not_found "race not defined" and return if p[:race_id].nil?


        pet = Pet.new(p)
        if pet.save