app/controllers/races_controller.rb

    def index
        query = params[:query] || ""
        @races = Race.where("name like ?", "%#{query}%").order(:name)
---
SELECT "races".* FROM "races" WHERE (name like '%%')  ORDER BY "races"."name" ASC

    def create
        if !params[:race].present?
            render_errors(["race not found"])
            return
        end

        race = Race.new(race_params)
        if race.valid? && race.save
---
INSERT INTO "races" ("name", "image", "about", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)