app/controllers/reviews_controller.rb

  def index
    last_index = params[:last_index] || 0
    @reviews = Review.includes(:writer).where(user_id: params[:user_id]).where("id > ?", last_index)
---
SELECT "reviews".* FROM "reviews" LEFT JOIN `users` ON `users`.`user_id` = `reviews`.`writer_id` WHERE "reviews"."user_id" = ?  [["user_id", 1]]

  def my_reviews
    last_index = params[:last_index] || 0
    @reviews = Review.includes(:user).where(writer_id: @current_user.id).where("id > ?", last_index)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."writer_id" = ? AND (id > '0')  [["writer_id", 1]]